{"title":"Crusty Bread","author":"Julia Thompson Eckel","image":"https://www.plattertalk.com/wp-content/uploads/2017/03/Crusty-Bread-Recipe.jpg","ingredients":[{"amount":"","ingredient":"","ammount":"3 Cup","name":"Flour"},{"amount":"","ingredient":"","ammount":"1/2 tsp.","name":"Instant Yeast"},{"amount":"","ingredient":"","ammount":"1-1/2 tsp.","name":"Salt"},{"amount":"","ingredient":"","ammount":"1-1/2 to 3/4 Cup","name":"Water (Room Temperature)"},{"amount":"","ingredient":"","ammount":"-","name":"Lidded cast iron dutch oven or clay dutch oven/pot."},{"amount":"","ingredient":"","ammount":"- ","name":"Any add-ins you want (nuts, dried fruits, cheese, spices etc.)"}],"directions":[{"step":"1","process":"In large bowl add in the flour, yeast and salt. You need to make sure the bowl is at least 2 times the size as this will double in volume."},{"step":"2","process":"Whisk to combine."},{"step":"3","process":"Add in the water and mix with a wooden spoon- do NOT use a stand mixer."},{"step":"4","process":"Mix it until it’s combined and forms a “shaggy” dough. Just make sure that all the flour is incorporated. It will to be a smooth dough- that’s how it supposed to be."},{"step":"5","process":"Cover with plastic wrap and set in a warm place overnight for at least 12 hours but no more than 24."},{"step":"6","process":"When you’re ready to bake, put the racking the middle and preheat to 450*."},{"step":"7","process":"When the oven reaches temp, put your dutch oven pot (cast iron or heavy ceramic in the oven WITH THE LID on. (check to see that your pot can handle 450* temp first.)"},{"step":"8","process":"Let heat up for 30 minutes"},{"step":"9","process":"While that’s heating up, use a dough scraper and scrape your dough onto a heavily floured surface (or you can flour parchment paper and put it on there)"},{"step":"10","process":"Shape into a ball, tucking the sides under. It will be sticky but that’s good."},{"step":"11","process":"Cover lightly with plastic unit the 30 minutes is up."},{"step":"12","process":"Remove the pot from the oven and plop the ball down in. Or if you transferred it to a floured parchment paper, you can place the whole thing inside (try to remove excess flour)"},{"step":"13","process":"Replace the lid and bake for 30 minutes. No peeking!"},{"step":"14","process":"Remove the lid and bake for another 15 minutes."},{"step":"15","process":"Remove from the oven and using tongs remove the bread and cool on cooling rack."}],"category":"Appetizers"}